- Joins
- Concat
- Coding

In [1]:
import pandas as pd
df = pd.read_csv(r"C:\Users\User\Python\IIITB\Foundation\superstore_sales.csv")
df.head()

,Order ID,Order Date,Order Priority,Order Quantity,Sales,Discount,Ship Mode,Profit,Unit Price,Shipping Cost,Customer Name,Province,Region,Customer Segment,Product Category,Product Sub-Category,Product Base Margin,Ship Date
0,3,13-10-2010,Low,6,261.5400,0.04,Regular Air,-213.25,38.94,35.00,Muhammed MacIntyre,Nunavut,Nunavut,Small Business,Office Supplies,Storage & Organization,0.80,20-10-2010
1,293,01-10-2012,High,49,10123.0200,0.07,Delivery Truck,457.81,208.16,68.02,Barry French,Nunavut,Nunavut,Consumer,Office Supplies,Appliances,0.58,02-10-2012
2,293,01-10-2012,High,27,244.5700,0.01,Regular Air,46.71,8.69,2.99,Barry French,Nunavut,Nunavut,Consumer,Office Supplies,Binders and Binder Accessories,0.39,03-10-2012
3,483,10-07-2011,High,30,4965.7595,0.08,Regular Air,1198.97,195.99,3.99,Clay Rozendal,Nunavut,Nunavut,Corporate,Technology,Telephones and Communication,0.58,12-07-2011
4,515,28-08-2010,Not Specified,19,394.2700,0.08,Regular Air,30.94,21.78,5.94,Carlos Soltero,Nunavut,Nunavut,Consumer,Office Supplies,Appliances,0.50,30-08-2010

In [2]:
dict = {'Name':['John','Sam','Martin'],'ID':[12,34,14]}
dict1 = {'Location':['OL','GS','OV'],'ID':[22,34,64]}
emp = pd.DataFrame(dict)
loc = pd.DataFrame(dict1)
loc

  Location  ID
0       OL  22
1       GS  34
2       OV  64

In [3]:
emp

     Name  ID
0    John  12
1     Sam  34
2  Martin  14

In [4]:
# Inner Join
# Only Common Elements
emp1 = emp.merge(loc,on='ID')
emp1

  Name  ID Location
0  Sam  34       GS

In [5]:
# Left Inner Join
# All from the left table & common from right table
emp1 = emp.merge(loc,how='left',on='ID')
emp1

     Name  ID Location
0    John  12      NaN
1     Sam  34       GS
2  Martin  14      NaN

In [6]:
# Right Inner Join
# All from the right table & common from left table
emp1 = emp.merge(loc,how='right',on='ID')
emp1

  Name  ID Location
0  NaN  22       OL
1  Sam  34       GS
2  NaN  64       OV

In [7]:
# Outer Join
# All both the tables
emp1 = emp.merge(loc,how='outer')
emp1

     Name  ID Location
0    John  12      NaN
1  Martin  14      NaN
2     NaN  22       OL
3     Sam  34       GS
4     NaN  64       OV

In [8]:
dict = {'Name':['John','Sam','Martin'],'ID1':[12,34,14]}
dict1 = {'Location':['OL','GS','OV'],'ID2':[22,34,64]}
emp1 = pd.DataFrame(dict)
loc1 = pd.DataFrame(dict1)

In [9]:
emp1

     Name  ID1
0    John   12
1     Sam   34
2  Martin   14

In [10]:
loc1

  Location  ID2
0       OL   22
1       GS   34
2       OV   64

In [11]:
emp2 = emp1.merge(loc1,how='left',left_on='ID1',right_on='ID2')
emp2

     Name  ID1 Location   ID2
0    John   12      NaN   NaN
1     Sam   34       GS  34.0
2  Martin   14      NaN   NaN

In [12]:
# Dataframe.Merge to join 2 dataframes
# on = based on the common element ['ID','ID2']
# how = what type of join you want {outer,inner,left, right}
# what if comman elemnsts name differ, left_on & right_on
# No joins without any common elements

In [13]:
# Concat
# Axis = 1 columns
# Axis = 0 rows
emp4 = pd.concat([emp,loc])
emp4

     Name  ID Location
0    John  12      NaN
1     Sam  34      NaN
2  Martin  14      NaN
0     NaN  22       OL
1     NaN  34       GS
2     NaN  64       OV

In [14]:
emp5 = pd.concat([emp,loc],axis=1)
emp5

     Name  ID Location  ID
0    John  12       OL  22
1     Sam  34       GS  34
2  Martin  14       OV  64

In [15]:
df.shape
df1 = df.copy()
df1.shape

(8399, 18)

In [16]:
df2=pd.concat([df,df1])
df2.shape

(16798, 18)

In [18]:
import numpy as np
np.random.seed(15)
li = list(np.random.randn(5))
li

[-0.3123284815435444,
 0.3392847060461844,
 -0.15590853388271336,
 -0.5017896732977485,
 0.2355688917260193]

In [19]:
import numpy as np
np.random.seed(0)
left_df = pd.DataFrame({'transaction_id': ['A', 'B', 'C', 'D'], 
                       'user_id': ['Peter', 'John', 'John', 'Anna'],
                       'value': np.random.randn(4),
                      })
# users
right_df = pd.DataFrame({'user_id': ['Paul', 'Mary', 'John',
                                     'Anna'],
                        'favorite_color': ['blue', 'blue', 'red', 
                                           np.NaN],
                       })

In [20]:
left_df

  transaction_id user_id     value
0              A   Peter  1.764052
1              B    John  0.400157
2              C    John  0.978738
3              D    Anna  2.240893

In [21]:
right_df

  user_id favorite_color
0    Paul           blue
1    Mary           blue
2    John            red
3    Anna            NaN

In [22]:
new_df = left_df.merge(right_df,on='user_id',how='outer')
new_df

  transaction_id user_id     value favorite_color
0              D    Anna  2.240893            NaN
1              B    John  0.400157            red
2              C    John  0.978738            red
3            NaN    Mary       NaN           blue
4            NaN    Paul       NaN           blue
5              A   Peter  1.764052            NaN

In [23]:
new_df[new_df['favorite_color']=='red']

  transaction_id user_id     value favorite_color
1              B    John  0.400157            red
2              C    John  0.978738            red

In [24]:
s1 = new_df[new_df['favorite_color']=='red'].sum()
s1.iloc[2]

1.3788951924729624